# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.11-s014_1 on Wed Oct 23 15:26:54 CEST 2019

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design keccak

create_clock -name "CLK" -add -period 4.0 -waveform {0.0 2.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports buffer_full]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[511]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[510]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[509]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[508]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[507]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[506]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[505]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[504]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[503]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[502]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[501]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[500]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[499]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[498]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[497]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[496]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[495]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[494]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[493]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[492]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[491]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[490]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[489]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[488]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[487]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[486]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[485]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[484]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[483]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[482]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[481]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[480]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[479]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[478]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[477]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[476]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[475]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[474]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[473]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[472]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[471]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[470]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[469]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[468]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[467]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[466]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[465]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[464]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[463]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[462]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[461]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[460]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[459]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[458]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[457]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[456]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[455]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[454]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[453]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[452]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[451]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[450]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[449]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[448]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[447]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[446]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[445]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[444]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[443]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[442]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[441]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[440]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[439]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[438]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[437]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[436]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[435]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[434]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[433]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[432]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[431]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[430]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[429]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[428]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[427]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[426]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[425]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[424]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[423]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[422]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[421]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[420]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[419]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[418]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[417]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[416]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[415]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[414]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[413]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[412]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[411]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[410]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[409]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[408]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[407]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[406]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[405]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[404]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[403]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[402]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[401]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[400]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[399]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[398]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[397]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[396]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[395]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[394]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[393]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[392]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[391]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[390]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[389]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[388]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[387]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[386]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[385]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[384]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[383]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[382]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[381]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[380]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[379]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[378]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[377]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[376]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[375]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[374]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[373]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[372]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[371]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[370]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[369]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[368]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[367]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[366]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[365]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[364]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[363]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[362]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[361]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[360]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[359]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[358]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[357]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[356]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[355]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[354]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[353]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[352]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[351]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[350]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[349]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[348]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[347]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[346]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[345]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[344]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[343]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[342]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[341]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[340]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[339]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[338]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[337]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[336]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[335]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[334]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[333]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[332]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[331]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[330]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[329]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[328]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[327]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[326]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[325]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[324]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[323]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[322]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[321]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[320]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[319]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[318]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[317]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[316]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[315]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[314]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[313]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[312]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[311]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[310]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[309]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[308]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[307]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[306]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[305]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[304]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[303]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[302]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[301]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[300]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[299]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[298]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[297]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[296]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[295]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[294]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[293]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[292]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[291]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[290]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[289]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[288]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[287]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[286]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[285]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[284]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[283]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[282]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[281]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[280]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[279]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[278]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[277]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[276]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[275]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[274]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[273]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[272]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[271]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[270]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[269]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[268]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[267]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[266]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[265]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[264]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[263]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[262]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[261]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[260]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[259]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[258]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[257]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[256]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[255]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[254]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[253]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[252]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[251]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[250]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[249]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[248]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[247]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[246]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[245]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[244]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[243]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[242]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[241]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[240]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[239]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[238]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[237]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[236]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[235]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[234]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[233]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[232]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[231]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[230]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[229]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[228]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[227]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[226]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[225]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[224]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[223]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[222]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[221]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[220]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[219]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[218]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[217]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[216]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[215]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[214]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[213]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[212]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[211]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[210]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[209]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[208]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[207]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[206]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[205]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[204]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[203]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[202]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[201]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[200]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[199]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[198]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[197]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[196]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[195]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[194]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[193]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[192]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[191]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[190]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[189]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[188]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[187]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[186]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[185]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[184]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[183]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[182]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[181]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[180]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[179]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[178]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[177]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[176]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[175]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[174]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[173]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[172]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[171]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[170]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[169]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[168]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[167]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[166]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[165]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[164]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[163]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[162]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[161]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[160]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[159]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[158]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[157]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[156]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[155]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[154]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[153]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[152]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[151]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[150]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[149]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[148]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[147]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[146]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[145]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[144]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[143]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[142]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[141]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[140]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[139]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[138]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[137]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[136]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[135]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[134]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[133]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[132]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[131]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[130]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[129]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[128]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[127]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[126]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[125]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[124]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[123]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[122]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[121]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[120]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[119]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[118]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[117]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[116]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[115]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[114]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[113]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[112]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[111]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[110]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[109]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[108]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[107]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[106]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[105]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[104]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[103]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[102]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[101]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[100]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[99]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[98]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[97]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[96]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[95]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[94]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[93]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[92]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[91]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[90]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[89]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[88]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[87]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[86]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[85]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[84]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[83]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[82]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[81]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[80]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[79]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[78]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[77]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[76]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[75]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[74]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[73]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[72]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[71]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[70]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[69]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[68]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[67]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[66]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[65]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[64]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[63]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[62]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[61]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[60]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[59]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[58]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[57]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[56]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[55]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[54]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[53]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[52]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[51]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[50]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[49]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[48]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[47]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[46]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[45]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[44]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[43]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[42]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[41]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[40]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[39]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[38]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[37]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[36]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[35]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[34]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[33]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[32]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[31]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {out[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports out_ready]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports buffer_full]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[511]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[510]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[509]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[508]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[507]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[506]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[505]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[504]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[503]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[502]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[501]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[500]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[499]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[498]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[497]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[496]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[495]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[494]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[493]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[492]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[491]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[490]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[489]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[488]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[487]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[486]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[485]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[484]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[483]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[482]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[481]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[480]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[479]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[478]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[477]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[476]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[475]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[474]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[473]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[472]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[471]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[470]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[469]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[468]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[467]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[466]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[465]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[464]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[463]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[462]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[461]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[460]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[459]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[458]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[457]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[456]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[455]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[454]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[453]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[452]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[451]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[450]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[449]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[448]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[447]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[446]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[445]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[444]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[443]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[442]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[441]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[440]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[439]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[438]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[437]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[436]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[435]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[434]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[433]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[432]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[431]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[430]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[429]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[428]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[427]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[426]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[425]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[424]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[423]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[422]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[421]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[420]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[419]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[418]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[417]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[416]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[415]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[414]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[413]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[412]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[411]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[410]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[409]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[408]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[407]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[406]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[405]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[404]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[403]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[402]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[401]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[400]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[399]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[398]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[397]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[396]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[395]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[394]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[393]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[392]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[391]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[390]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[389]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[388]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[387]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[386]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[385]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[384]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[383]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[382]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[381]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[380]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[379]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[378]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[377]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[376]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[375]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[374]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[373]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[372]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[371]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[370]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[369]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[368]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[367]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[366]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[365]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[364]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[363]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[362]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[361]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[360]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[359]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[358]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[357]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[356]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[355]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[354]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[353]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[352]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[351]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[350]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[349]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[348]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[347]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[346]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[345]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[344]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[343]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[342]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[341]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[340]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[339]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[338]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[337]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[336]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[335]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[334]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[333]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[332]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[331]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[330]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[329]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[328]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[327]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[326]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[325]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[324]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[323]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[322]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[321]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[320]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[319]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[318]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[317]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[316]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[315]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[314]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[313]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[312]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[311]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[310]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[309]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[308]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[307]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[306]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[305]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[304]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[303]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[302]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[301]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[300]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[299]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[298]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[297]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[296]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[295]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[294]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[293]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[292]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[291]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[290]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[289]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[288]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[287]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[286]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[285]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[284]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[283]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[282]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[281]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[280]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[279]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[278]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[277]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[276]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[275]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[274]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[273]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[272]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[271]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[270]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[269]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[268]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[267]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[266]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[265]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[264]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[263]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[262]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[261]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[260]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[259]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[258]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[257]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[256]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[255]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[254]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[253]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[252]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[251]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[250]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[249]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[248]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[247]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[246]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[245]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[244]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[243]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[242]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[241]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[240]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[239]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[238]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[237]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[236]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[235]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[234]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[233]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[232]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[231]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[230]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[229]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[228]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[227]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[226]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[225]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[224]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[223]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[222]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[221]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[220]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[219]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[218]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[217]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[216]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[215]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[214]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[213]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[212]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[211]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[210]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[209]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[208]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[207]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[206]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[205]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[204]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[203]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[202]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[201]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[200]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[199]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[198]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[197]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[196]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[195]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[194]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[193]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[192]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[191]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[190]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[189]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[188]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[187]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[186]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[185]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[184]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[183]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[182]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[181]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[180]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[179]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[178]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[177]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[176]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[175]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[174]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[173]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[172]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[171]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[170]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[169]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[168]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[167]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[166]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[165]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[164]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[163]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[162]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[161]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[160]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[159]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[158]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[157]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[156]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[155]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[154]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[153]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[152]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[151]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[150]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[149]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[148]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[147]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[146]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[145]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[144]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[143]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[142]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[141]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[140]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[139]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[138]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[137]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[136]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[135]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[134]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[133]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[132]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[131]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[130]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[129]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[128]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[127]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[126]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[125]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[124]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[123]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[122]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[121]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[120]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[119]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[118]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[117]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[116]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[115]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[114]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[113]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[112]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[111]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[110]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[109]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[108]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[107]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[106]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[105]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[104]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[103]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[102]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[101]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[100]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[99]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[98]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[97]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[96]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[95]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[94]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[93]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[92]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[91]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[90]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[89]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[88]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[87]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[86]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[85]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[84]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[83]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[82]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[81]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[80]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[79]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[78]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[77]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[76]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[75]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[74]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[73]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[72]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[71]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[70]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[69]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[68]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[67]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[66]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[65]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[64]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[63]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[62]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[61]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[60]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[59]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[58]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[57]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[56]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[55]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[54]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[53]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[52]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[51]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[50]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[49]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[48]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[47]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[46]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[45]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[44]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[43]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[42]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[41]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[40]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[39]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[38]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[37]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[36]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[35]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[34]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[33]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[32]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[31]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {out[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports out_ready]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports reset]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[63]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[62]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[61]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[60]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[59]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[58]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[57]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[56]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[55]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[54]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[53]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[52]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[51]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[50]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[49]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[48]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[47]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[46]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[45]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[44]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[43]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[42]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[41]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[40]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[39]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[38]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[37]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[36]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[35]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[34]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[33]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[32]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[31]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[30]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {in[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports in_ready]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports is_last]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {byte_num[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {byte_num[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -max 0.1 [get_ports {byte_num[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports reset]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[63]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[62]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[61]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[60]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[59]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[58]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[57]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[56]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[55]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[54]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[53]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[52]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[51]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[50]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[49]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[48]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[47]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[46]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[45]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[44]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[43]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[42]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[41]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[40]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[39]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[38]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[37]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[36]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[35]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[34]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[33]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[32]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[31]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[30]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {in[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports in_ready]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports is_last]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {byte_num[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {byte_num[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.05 [get_ports {byte_num[0]}]
set_clock_uncertainty -setup 0.005 [get_clocks CLK]
set_clock_uncertainty -hold 0.005 [get_clocks CLK]
